_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_РаспределениеПоАналитикеГрафикаДоговоров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_ГрафикДвиженийПоДоговору</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_АктПриемкиРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.УСОERP_РеализацияСтроительныхРаботВнутренняя</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетДавальцу</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ВзаимозачетЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.УСОERP_РеализацияСтроительныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУтверждения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаспределениеПоАналитикеДоговора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокРасчетов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыКлиентом</v8:Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокДоходовРасходов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ПорядокДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ДополнительныеПараметрыПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ДополнительныеПараметрыПоДоговору</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДоговорРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ПорядокДоходовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ПорядокДоходовРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеЗатрат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РаспределениеПоАналитикеГрафикаДоговоров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура 	ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт				
	
	ДокументыДС = Новый СписокЗначений;
	ДокументыДС.Добавить(Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств"));
	ДокументыДС.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
	ДокументыДС.Добавить(Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств"));
	ДокументыДС.Добавить(Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств"));
	ДокументыДС.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
	
	ДокументыДР = Новый СписокЗначений;
	ДокументыДР.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
	ДокументыДР.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	ДокументыДР.Добавить(Тип("ДокументСсылка.РеализацияУслугПрочихАктивов"));
	ДокументыДР.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтКлиента"));
	ДокументыДР.Добавить(Тип("ДокументСсылка.АктВыполненныхРабот"));
	ДокументыДР.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	ДокументыДР.Добавить(Тип("ДокументСсылка.ПриобретениеТоваровУслуг"));
	ДокументыДР.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
	ДокументыДР.Добавить(Тип("ДокументСсылка.ОтчетПереработчика"));
	ДокументыДР.Добавить(Тип("ДокументСсылка.УСОERP_АктПриемкиРабот"));
	ДокументыДР.Добавить(Тип("ДокументСсылка.УСОERP_РеализацияСтроительныхРабот"));
	Если Метаданные.Документы.Найти("ОтчетДавальцу") <> Неопределено Тогда
		ДокументыДР.Добавить(Тип("ДокументСсылка.ОтчетДавальцу"));
	КонецЕсли;
	
	СписокЗаявок = Новый СписокЗначений;
	СписокЗаявок.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
	СписокЗаявок.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	СписокЗаявок.Добавить(Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств"));
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УСОERP_ДополнительныеПараметрыПоДоговору.Ссылка КАК ДополнительныеПараметрыПоДоговору
		|ПОМЕСТИТЬ ДопПараметрыПоДоговору
		|ИЗ
		|	Документ.УСОERP_ДополнительныеПараметрыПоДоговору КАК УСОERP_ДополнительныеПараметрыПоДоговору
		|ГДЕ
		|	УСОERP_ДополнительныеПараметрыПоДоговору.Договор = &Договор
		|	И НЕ УСОERP_ДополнительныеПараметрыПоДоговору.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	УСОERP_ДополнительныеПараметрыПоДоговору.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаРасходованиеДенежныхСредств.Ссылка) КАК Количество
		|ПОМЕСТИТЬ КоличествоЗаявокНаРасходование
		|ИЗ
		|	Документ.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров КАК УСОERP_РаспределениеПоАналитикеГрафикаДоговоров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
		|		ПО УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование.ЗаявкаНаРасходованиеДенежныхСредств = ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
		|ГДЕ
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Ссылка = &Ссылка
		|	И (УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
		|			ИЛИ УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование ССЫЛКА Документ.РасходныйКассовыйОрдер)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК Количество
		|ПОМЕСТИТЬ КоличествоЗаказовКлиента
		|ИЗ
		|	Документ.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров КАК УСОERP_РаспределениеПоАналитикеГрафикаДоговоров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ПО УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Организация = ЗаказКлиента.Организация
		|			И УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Партнер = ЗаказКлиента.Партнер
		|			И УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Соглашение = ЗаказКлиента.Соглашение
		|			И УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Контрагент = ЗаказКлиента.Контрагент
		|			И УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Договор = ЗаказКлиента.Договор
		|ГДЕ
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказПоставщику.Ссылка) КАК Количество
		|ПОМЕСТИТЬ КоличествоЗаказовПоставщику
		|ИЗ
		|	Документ.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров КАК УСОERP_РаспределениеПоАналитикеГрафикаДоговоров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|		ПО УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Организация = ЗаказПоставщику.Организация
		|			И УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Партнер = ЗаказПоставщику.Партнер
		|			И УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Соглашение = ЗаказПоставщику.Соглашение
		|			И УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Контрагент = ЗаказПоставщику.Контрагент
		|			И УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Договор = ЗаказПоставщику.Договор
		|ГДЕ
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ВидДвиженияРасход КАК ВидДвижения,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Дата КАК Период,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Ссылка КАК Регистратор,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Организация КАК Организация,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Партнер КАК Партнер,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Соглашение КАК Соглашение,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Контрагент КАК Контрагент,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Договор КАК Договор,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Дата КАК ДатаСобытияПоДоговору,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.ПорядокРасчетов КАК ПорядокОплаты,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.ПорядокДоходовРасходов КАК ПорядокДоходовРасходов,
		|	ВЫБОР
		|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоВидамРабот
		|			ТОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.ВидРабот
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
		|	КОНЕЦ КАК ВидРабот,
		|	ВЫБОР
		|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоРаботам
		|			ТОГДА ВЫБОР
		|					КОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|						ТОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Работа
		|					ИНАЧЕ УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Работа.РаботаИсточник
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|	КОНЕЦ КАК Работа,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ОбъектСтроительства КАК ОбъектСтроительства,
		|	ВЫБОР
		|		КОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
		|			ТОГДА ЕСТЬNULL(УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ФинансированиеПлан,
		|	0 КАК ФинансированиеФакт,
		|	ВЫБОР
		|		КОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование ССЫЛКА Документ.ЗаказКлиента
		|				ИЛИ УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование ССЫЛКА Документ.ЗаказПоставщику
		|			ТОГДА ЕСТЬNULL(УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПорядокДоходовРасходовПлан,
		|	0 КАК ПорядокДоходовРасходовФакт,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.СтатьяБюджета КАК СтатьяБюджета
		|ИЗ
		|	Документ.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.РаспределениеПоАналитикеДоговора КАК УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров КАК УСОERP_РаспределениеПоАналитикеГрафикаДоговоров
		|		ПО УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Ссылка = УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Ссылка,
		|	ДопПараметрыПоДоговору КАК ДопПараметрыПоДоговору
		|ГДЕ
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Ссылка = &Ссылка
		|	И ТИПЗНАЧЕНИЯ(УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование) В (&СписокЗаявок)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	&ВидДвиженияПриход,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Дата,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Ссылка,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Организация,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Партнер,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Соглашение,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Контрагент,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Договор,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Дата,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.ПорядокРасчетов,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.ПорядокДоходовРасходов,
		|	ВЫБОР
		|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоВидамРабот
		|			ТОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.ВидРабот
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоРаботам
		|			ТОГДА ВЫБОР
		|					КОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|						ТОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Работа
		|					ИНАЧЕ УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Работа.РаботаИсточник
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|	КОНЕЦ,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ОбъектСтроительства,
		|	0,
		|	ВЫБОР
		|		КОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
		|			ТОГДА ЕСТЬNULL(УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование ССЫЛКА Документ.ЗаказКлиента
		|				ИЛИ УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование ССЫЛКА Документ.ЗаказПоставщику
		|			ТОГДА ЕСТЬNULL(УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.СтатьяДвиженияДенежныхСредств,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.СтатьяБюджета
		|ИЗ
		|	Документ.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.РаспределениеПоАналитикеДоговора КАК УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров КАК УСОERP_РаспределениеПоАналитикеГрафикаДоговоров
		|		ПО УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Ссылка = УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Ссылка,
		|	ДопПараметрыПоДоговору КАК ДопПараметрыПоДоговору
		|ГДЕ
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Ссылка = &Ссылка
		|	И ТИПЗНАЧЕНИЯ(УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование) В (&СписокЗаявок)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	&ВидДвиженияРасход,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Дата,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Ссылка,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Организация,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Партнер,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Соглашение,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Контрагент,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Договор,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Дата,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.ПорядокРасчетов,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.ПорядокДоходовРасходов,
		|	ВЫБОР
		|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоВидамРабот
		|			ТОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.ВидРабот
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоРаботам
		|			ТОГДА ВЫБОР
		|					КОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|						ТОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Работа
		|					ИНАЧЕ УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Работа.РаботаИсточник
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|	КОНЕЦ,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ОбъектСтроительства,
		|	0,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование) В (&ДокументыДС)
		|			ТОГДА ЕСТЬNULL(УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование) В (&ДокументыДР)
		|			ТОГДА ЕСТЬNULL(УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.СтатьяДвиженияДенежныхСредств,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.СтатьяБюджета
		|ИЗ
		|	Документ.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.РаспределениеПоАналитикеДоговора КАК УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров КАК УСОERP_РаспределениеПоАналитикеГрафикаДоговоров
		|		ПО УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Ссылка = УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Ссылка,
		|	ДопПараметрыПоДоговору КАК ДопПараметрыПоДоговору
		|ГДЕ
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Ссылка = &Ссылка
		|	И НЕ ТИПЗНАЧЕНИЯ(УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование) В (&СписокЗаявок)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	&ВидДвиженияРасход,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Дата,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Ссылка,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Организация,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Партнер,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Соглашение,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Контрагент,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Договор,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Дата,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.ПорядокРасчетов,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.ПорядокДоходовРасходов,
		|	ВЫБОР
		|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоВидамРабот
		|			ТОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.ВидРабот
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоРаботам
		|			ТОГДА ВЫБОР
		|					КОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|						ТОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Работа
		|					ИНАЧЕ УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Работа.РаботаИсточник
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|	КОНЕЦ,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ОбъектСтроительства,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование) В (&ДокументыДС)
		|			ТОГДА ЕСТЬNULL(УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование) В (&ДокументыДР)
		|			ТОГДА ЕСТЬNULL(УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.СтатьяДвиженияДенежныхСредств,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.СтатьяБюджета
		|ИЗ
		|	Документ.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.РаспределениеПоАналитикеДоговора КАК УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров КАК УСОERP_РаспределениеПоАналитикеГрафикаДоговоров
		|		ПО УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Ссылка = УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Ссылка,
		|	КоличествоЗаявокНаРасходование КАК КоличествоЗаявокНаРасходование,
		|	КоличествоЗаказовКлиента КАК КоличествоЗаказовКлиента,
		|	КоличествоЗаказовПоставщику КАК КоличествоЗаказовПоставщику,
		|	ДопПараметрыПоДоговору КАК ДопПараметрыПоДоговору
		|ГДЕ
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Ссылка = &Ссылка
		|	И НЕ ТИПЗНАЧЕНИЯ(УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование) В (&СписокЗаявок)
		|	И КоличествоЗаказовКлиента.Количество = 0
		|	И КоличествоЗаказовПоставщику.Количество = 0
		|	И КоличествоЗаявокНаРасходование.Количество = 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	&ВидДвиженияПриход,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Дата,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Ссылка,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Организация,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Партнер,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Соглашение,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Контрагент,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Договор,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Дата,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.ПорядокРасчетов,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.ПорядокДоходовРасходов,
		|	ВЫБОР
		|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоВидамРабот
		|			ТОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.ВидРабот
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДопПараметрыПоДоговору.ДополнительныеПараметрыПоДоговору.ПоРаботам
		|			ТОГДА ВЫБОР
		|					КОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|						ТОГДА УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Работа
		|					ИНАЧЕ УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Работа.РаботаИсточник
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|	КОНЕЦ,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ОбъектСтроительства,
		|	0,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование) В (&ДокументыДС)
		|			ТОГДА ЕСТЬNULL(УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование) В (&ДокументыДР)
		|			ТОГДА ЕСТЬNULL(УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.СтатьяДвиженияДенежныхСредств,
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.СтатьяБюджета
		|ИЗ
		|	Документ.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.РаспределениеПоАналитикеДоговора КАК УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров КАК УСОERP_РаспределениеПоАналитикеГрафикаДоговоров
		|		ПО УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Ссылка = УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.Ссылка,
		|	КоличествоЗаявокНаРасходование КАК КоличествоЗаявокНаРасходование,
		|	КоличествоЗаказовКлиента КАК КоличествоЗаказовКлиента,
		|	КоличествоЗаказовПоставщику КАК КоличествоЗаказовПоставщику,
		|	ДопПараметрыПоДоговору КАК ДопПараметрыПоДоговору
		|ГДЕ
		|	УСОERP_РаспределениеПоАналитикеГрафикаДоговоровРаспределениеПоАналитикеДоговора.Ссылка = &Ссылка
		|	И НЕ ТИПЗНАЧЕНИЯ(УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ДокументОснование) В (&СписокЗаявок)
		|	И КоличествоЗаказовКлиента.Количество = 0
		|	И КоличествоЗаказовПоставщику.Количество = 0
		|	И КоличествоЗаявокНаРасходование.Количество = 0";

			
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 		ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 		ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Договор",				ДокументСсылка.Договор);
	Запрос.УстановитьПараметр("ДокументыДС", 			ДокументыДС);
	Запрос.УстановитьПараметр("ДокументыДР", 			ДокументыДР);
	Запрос.УстановитьПараметр("СписокЗаявок", 			СписокЗаявок);
	Запрос.УстановитьПараметр("Ссылка", 				ДокументСсылка);
		
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРаспределениеПоАналитикеДоговора",	Результат[4].Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура 	ДобавитьКомандыПечати(КомандыПечати) Экспорт				

КонецПроцедуры

#КонецОбласти 

#Область ЗаполнениеДокумента

Процедура ЗаполнитьНаОснованииАктаПриемкиРабот(ПараметрыЗаполнения) Экспорт
	
	ДокументОснование =  ПараметрыЗаполнения.ДокументОснование;
	ДанныеРаспределения =  ПараметрыЗаполнения.ДанныеРаспределения;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Регистратор.СтатьяБюджетаБДР, ЗНАЧЕНИЕ(Справочник.СтатьиБюджетов.ПустаяСсылка)) КАК СтатьяБДР,
	|	УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Регистратор.ПоВидамРабот КАК ПоВидамРабот
	|ПОМЕСТИТЬ ВТ_СтатьиБДР
	|ИЗ
	|	РегистрСведений.УСОERP_ДополнительныеПараметрыПоДоговору.СрезПоследних(
	|			&КонецПериода,
	|			Договор = &Договор
	|				И ОбъектСтроительства = &ОбъектСтроительства) КАК УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних
	|ГДЕ
	|	ЕСТЬNULL(УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Регистратор.СтатьяБюджетаБДР, ЗНАЧЕНИЕ(Справочник.СтатьиБюджетов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтатьиБюджетов.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СтатьиБДР.ПоВидамРабот, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.Пустаяссылка)
	|		ИНАЧЕ УСОERP_АктПриемкиРаботРаботы.Работа
	|	КОНЕЦ КАК Работа,
	|	СУММА(УСОERP_АктПриемкиРаботРаботы.СуммаСНДС) КАК Сумма,
	|	ВТ_СтатьиБДР.СтатьяБДР КАК СтатьяБюджета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СтатьиБДР.ПоВидамРабот, ЛОЖЬ)
	|			ТОГДА УСОERP_АктПриемкиРаботРаботы.Работа.ВидРабот
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.Пустаяссылка)
	|	КОНЕЦ КАК ВидРабот,
	|	ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПоступлениеЗатрат) КАК ПорядокДоходовРасходов
	|ИЗ
	|	Документ.УСОERP_АктПриемкиРабот.Работы КАК УСОERP_АктПриемкиРаботРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатьиБДР КАК ВТ_СтатьиБДР
	|		ПО (ИСТИНА)
	|ГДЕ
	|	УСОERP_АктПриемкиРаботРаботы.Ссылка = &ДокументОснование
	|	И УСОERP_АктПриемкиРаботРаботы.Работа.СуммарнаяРабота = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СтатьиБДР.СтатьяБДР,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СтатьиБДР.ПоВидамРабот, ЛОЖЬ)
	|			ТОГДА УСОERP_АктПриемкиРаботРаботы.Работа.ВидРабот
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.Пустаяссылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СтатьиБДР.ПоВидамРабот, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.Пустаяссылка)
	|		ИНАЧЕ УСОERP_АктПриемкиРаботРаботы.Работа
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(УСОERP_АктПриемкиРаботРаботы.СуммаСНДС) <> 0";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница( КонецДня(ПараметрыЗаполнения.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Договор", ПараметрыЗаполнения.Договор);
	Запрос.УстановитьПараметр("ОбъектСтроительства", ПараметрыЗаполнения.ОбъектСтроительства);
	
	Результат = Запрос.Выполнить();
	
	ДанныеРаспределения = Результат.Выгрузить();
	
	ПараметрыЗаполнения.ДанныеРаспределения = ДанныеРаспределения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииРеализацииСтроительныхРабот(ПараметрыЗаполнения) Экспорт
	
	ДокументОснование 	=  ПараметрыЗаполнения.ДокументОснование;
	ДанныеРаспределения =  ПараметрыЗаполнения.ДанныеРаспределения;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Регистратор.СтатьяБюджетаБДР, ЗНАЧЕНИЕ(Справочник.СтатьиБюджетов.ПустаяСсылка)) КАК СтатьяБДР,
	|	УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Регистратор.ПоВидамРабот КАК ПоВидамРабот
	|ПОМЕСТИТЬ ВТ_СтатьиБДР
	|ИЗ
	|	РегистрСведений.УСОERP_ДополнительныеПараметрыПоДоговору.СрезПоследних(
	|			&КонецПериода,
	|			Договор = &Договор
	|				И ОбъектСтроительства = &ОбъектСтроительства) КАК УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних
	|ГДЕ
	|	ЕСТЬNULL(УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Регистратор.СтатьяБюджетаБДР, ЗНАЧЕНИЕ(Справочник.СтатьиБюджетов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтатьиБюджетов.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СтатьиБДР.ПоВидамРабот, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.Пустаяссылка)
	|		ИНАЧЕ УСОERP_РеализацияСтроительныхРаботРаботы.Работа
	|	КОНЕЦ КАК Работа,
	|	СУММА(УСОERP_РеализацияСтроительныхРаботРаботы.СуммаСНДС) КАК Сумма,
	|	ВТ_СтатьиБДР.СтатьяБДР КАК СтатьяБюджета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СтатьиБДР.ПоВидамРабот, ЛОЖЬ)
	|			ТОГДА УСОERP_РеализацияСтроительныхРаботРаботы.Работа.ВидРабот
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.Пустаяссылка)
	|	КОНЕЦ КАК ВидРабот,
	|	ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.Реализация) КАК ПорядокДоходовРасходов
	|ИЗ
	|	Документ.УСОERP_РеализацияСтроительныхРабот.Работы КАК УСОERP_РеализацияСтроительныхРаботРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатьиБДР КАК ВТ_СтатьиБДР
	|		ПО (ИСТИНА)
	|ГДЕ
	|	УСОERP_РеализацияСтроительныхРаботРаботы.Ссылка = &ДокументОснование
	|	И НЕ УСОERP_РеализацияСтроительныхРаботРаботы.Работа.СуммарнаяРабота
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СтатьиБДР.СтатьяБДР,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СтатьиБДР.ПоВидамРабот, ЛОЖЬ)
	|			ТОГДА УСОERP_РеализацияСтроительныхРаботРаботы.Работа.ВидРабот
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.Пустаяссылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СтатьиБДР.ПоВидамРабот, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.Пустаяссылка)
	|		ИНАЧЕ УСОERP_РеализацияСтроительныхРаботРаботы.Работа
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(УСОERP_РеализацияСтроительныхРаботРаботы.СуммаСНДС) <> 0";
	
	Запрос.УстановитьПараметр("ДокументОснование", 		ДокументОснование);
	Запрос.УстановитьПараметр("КонецПериода", 			Новый Граница( КонецДня(ПараметрыЗаполнения.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Договор", 				ПараметрыЗаполнения.Договор);
	Запрос.УстановитьПараметр("ОбъектСтроительства", 	ПараметрыЗаполнения.ОбъектСтроительства);
	
	Результат = Запрос.Выполнить();
	
	ДанныеРаспределения = Результат.Выгрузить();
	
	ПараметрыЗаполнения.ДанныеРаспределения = ДанныеРаспределения;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
